app/views/books/home.html.erb

SELECT `authors`.* FROM `authors` WHERE `authors`.`book_id` = 1
---
			  <h5>publishing date : <%=book.publishing_date%></h5>
			  <h5>Authors : <%@authors=book.authors.all%>