app/views/books/index.html.erb

			  <h5>publishing date : <%=book.publishing_date%></h5>
			  <h5>Authors : <%@authors=book.authors.all%>
---
SELECT `authors`.* FROM `authors` WHERE (name LIKE '%gem1%') ORDER BY created_at DESC