app/views/books/show.html.erb

			    Authors :
			    <%@authors=@book.authors.all%>
---
SELECT `authors`.* FROM `authors` WHERE `authors`.`book_id` = 1