app/controllers/books_controller.rb

SELECT `books`.* FROM `books` ORDER BY created_at DESC
---
  def home
    @books=Book.all.order("created_at DESC")

SELECT  `books`.* FROM `books` WHERE `books`.`id` = 1 LIMIT 1
---
  def show
    @book=Book.find(params[:id])

INSERT INTO `books` (`title`, `publisher`, `isbn`, `publishing_date`, `created_at`, `updated_at`) VALUES ('fly', 'bird', 'qeww', '2001-05-20', '2017-09-25 17:23:12', '2017-09-25 17:23:12')
---
  def create
    @book=Book.new(book_params)
    if @book.save

SELECT  `books`.* FROM `books` WHERE `books`.`id` = 1 LIMIT 1
---
  def edit
    @book=Book.find(params[:id])

SELECT  `books`.* FROM `books` WHERE `books`.`id` = 1 LIMIT 1
SELECT `authors`.* FROM `authors` WHERE `authors`.`book_id` = 1 AND `authors`.`id` IN (1, 2)
UPDATE `authors` SET `name` = 'gem1', `updated_at` = '2017-09-25 07:13:13' WHERE `authors`.`id` = 1
UPDATE `books` SET `title` = 'bird', `updated_at` = '2017-09-25 10:40:18' WHERE `books`.`id` = 1
---
  def update
    @book=Book.find(params[:id])
    @authors=@book.authors.all
    if @book.update_attributes(book_params)

DELETE FROM `books` WHERE `books`.`id` = 3
SELECT  `books`.* FROM `books` WHERE `books`.`id` = 3 LIMIT 1
---
  def destroy
    Book.find(params[:id]).destroy

SELECT `books`.* FROM `books` WHERE (publisher OR title LIKE '%bird%') ORDER BY created_at DESC
SELECT `authors`.* FROM `authors` WHERE (name LIKE '%gem1%') ORDER BY created_at DESC
---
  def index
  if !params[:search].empty?
    @books = Book.searchpublisher(params[:search]).order("created_at DESC")
    @books+=Book.searchtitle(params[:search]).order("created_at DESC")
    @books+=Book.searchauthor(params[:search]).order("created_at DESC")