app/controllers/books_controller.rb

SELECT `authors`.* FROM `authors` WHERE `authors`.`book_id` = 60668565
UPDATE `books` SET `title` = 'chicken', `publisher` = 'fady', `isbn` = 'fff', `publishing_date` = '2001-01-11' WHERE `books`.`id` = 60668565
---
  def update
    @book=Book.find(params[:id])
    @authors=@book.authors.all
    if @book.update_attributes(book_params)